doc/array-notes.org
#+TITLE: S-SQL and Postgresql Arrays
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

[[file:s-sql.html][Return to s-sql.html]]
[[file:dao-classes.html][Return to dao-classes.html]]
[[file:postmodern.html][Return to postmodern.html]]

* Summary
  :PROPERTIES:
  :ID:       array-summary
  :END:
Arrays are a first class datatype within postgresql. The contents can only be of a single
datatype. Postgresql will enforce that typing. They can be multidimensional. The starting index is 1, not 0. Regardless of whether you specify an array length when you create a table,
Postgresql will always treat them as variable length.

Postmodern/s-sql can be used to insert common lisp arrays into postgresql databases,
pull postgresql database arrays out of databases into a common lisp array,
and generally engage in all the ways that sql can use postgresql arrays.
Postgresql arrays are documented at https://www.postgresql.org/docs/current/static/arrays.html
and https://www.postgresql.org/docs/current/static/functions-array.html.

The Postmodern dao-classes can also have slots that are common lisp arrays with the same utility.

This page will go into more detail on how to use the available operators and functions
in s-sql.

* Use cases for arrays in a database
  :PROPERTIES:
  :ID:       array-use-cases
  :END:

