doc/array-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-10-03 Mon 15:22 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL and Postgresql Arrays</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL and Postgresql Arrays</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5b5e1e9">Summary</a></li>
<li><a href="#orgb184e03">Use cases for arrays in a database</a>
<ul>
<li><a href="#org0501d46">General Usage</a></li>
<li><a href="#org3a3f1cb">Rules of Thumb - Do Not Use Arrays If:</a></li>
<li><a href="#org8ff0c90">Data Type Enforcement</a></li>
<li><a href="#orge4ec121">Indices on Arrays</a></li>
</ul>
</li>
<li><a href="#orga873376">S-SQL Array Support</a>
<ul>
<li><a href="#org111d808">:array (used inside a query calling a subquery, selecting into an array)</a></li>
<li><a href="#org4725d4e">:array[] (declares an array and returns an array</a></li>
<li><a href="#org3c67aab">:[] (used when you want a slice of an array</a></li>
<li><a href="#orgf09a891">General Usage Examples</a></li>
</ul>
</li>
<li><a href="#org826cf7c">Dao Class Support for Arrays</a></li>
<li><a href="#org51f254c">Array Operators</a>
<ul>
<li><a href="#org269876e">Array Comparison Operators</a>
<ul>
<li><a href="#org9047d71">:= Equality Comparison (Are two arrays equal on an element by element basis)</a></li>
<li><a href="#org1c80249">:&lt;&gt; Not Equal Comparison</a></li>
<li><a href="#org3fe0011">:&lt; Less Than Comparison</a></li>
<li><a href="#orgcda6285">:&gt; Greater Than Comparison</a></li>
<li><a href="#org343dd7c">:&gt;= Greater Than or Equal to Comparison</a></li>
<li><a href="#org0d854a7">:&lt;= Less Than or Equal To Comparison</a></li>
<li><a href="#orgeb938b5">:@&gt; Contains Comparison</a></li>
<li><a href="#orgfa75fef">:&lt;@ Is Contained By Comparison</a></li>
<li><a href="#org7f73a5a">:&amp;&amp; Has Elements in Common Comparison</a></li>
</ul>
</li>
<li><a href="#orgdbea427">Array Concatenation Operators</a>
<ul>
<li><a href="#org7645780">:|| Concatentation Arrays and Elements</a></li>
<li><a href="#orge2faadb">:|| Concatenation with Multi-Dimensional Arrays</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4ae78e1">Array functions</a>
<ul>
<li>
<ul>
<li><a href="#org2774760">Array-prepend</a></li>
<li><a href="#org553460c">array-append</a></li>
<li><a href="#org358241c">array-cat</a></li>
<li><a href="#orgbef29fc">array-ndims</a></li>
<li><a href="#org34dc0b7">array-dims</a></li>
<li><a href="#org1c9eb36">array-fill</a></li>
<li><a href="#org102910e">array-length</a></li>
<li><a href="#org5974698">array-lower</a></li>
<li><a href="#orgc5bc7b2">array-position</a></li>
<li><a href="#org5ae7695">array-positions</a></li>
<li><a href="#org0923f75">array-remove</a></li>
<li><a href="#orgd824c3c">array-replace</a></li>
<li><a href="#org7c3e8c8">array-to-string</a></li>
<li><a href="#orga7d29a9">array-upper</a></li>
<li><a href="#orgd589d9f">cardinality</a></li>
<li><a href="#org0e460cd">string-to-array</a></li>
<li><a href="#orgfb945cf">unnest</a></li>
<li><a href="#orgae7d8cb">array-agg</a></li>
</ul>
</li>
<li><a href="#org78d4fdc">NULL and nil</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
<a href="s-sql.html">Return to s-sql.html</a>
<a href="dao-classes.html">Return to dao-classes.html</a>
<a href="postmodern.html">Return to postmodern.html</a>
</p>

<div id="outline-container-org5b5e1e9" class="outline-2">
<h2 id="org5b5e1e9">Summary</h2>
<div class="outline-text-2" id="text-org5b5e1e9">
<p>
Arrays are a first class datatype within postgresql. The contents can only be of a single
datatype. Postgresql will enforce that typing. They can be multidimensional. The starting index is 1, not 0. Regardless of whether you specify an array length when you create a table,
Postgresql will always treat them as variable length.
</p>

<p>
Postmodern/s-sql can be used to insert common lisp arrays into postgresql databases,
pull postgresql database arrays out of databases into a common lisp array,
and generally engage in all the ways that sql can use postgresql arrays.
Postgresql arrays are documented at <a href="https://www.postgresql.org/docs/current/static/arrays.html">https://www.postgresql.org/docs/current/static/arrays.html</a>
and <a href="https://www.postgresql.org/docs/current/static/functions-array.html">https://www.postgresql.org/docs/current/static/functions-array.html</a>.
</p>

<p>
The Postmodern dao-classes can also have slots that are common lisp arrays with the same utility.
</p>

<p>
This page will go into more detail on how to use the available operators and functions
in s-sql.
</p>
</div>
</div>

<div id="outline-container-orgb184e03" class="outline-2">
<h2 id="orgb184e03">Use cases for arrays in a database</h2>
<div class="outline-text-2" id="text-orgb184e03">
</div>
