doc/array-notes.org
** Rules of Thumb - Do Not Use Arrays If:
   :PROPERTIES:
   :ID:       do-not-use-arrays-if
   :END:

- Do not use arrays where you need to maintain integrity for foreign relationships. That is what
foreign keys are for.

- Do not use arrays if you have to change the items in the array frequently.

- Do not use arrays if you rely on an ORM unless you have ensured
that the ORM can utilize arrays.


** Data Type Enforcement
   :PROPERTIES:
   :ID:       data-type-enforcement
   :END:
Compared to jsonb, postgresql arrays enforce the data type. This can be critical in both maintaining the integrity of your data as well as optimization in your appliction code.
This database enforced type safety does not, however, enforce the dimensionality of
the array.

** Indices on Arrays
   :PROPERTIES:
   :ID:       array-indices
   :END:
It is highly recommended that you use GIN or GIST indexes to search
for items in array column. You should remember that GIST indices are
lossy while GIN indices are lossless.


* S-SQL Array Support
  :PROPERTIES:
  :ID:       s-sql-array-support
  :END:
S-sql can feel a little messy with respect to arrays but that
is in large part because (a) sql dealing with arrays is messy and
(b) postgresql has both an array[] constructor and an array function.

If you are just translating between a lisp array and a
postgresql array, then postmodern handles the data type translation
fairly easily as can be seen in the examples below.

Generally speaking, there are three base s-sql array operators
to know:

** :array (used inside a query calling a subquery, selecting into an array)
   :PROPERTIES:
   :ID:       3b8392a6-bf06-4196-938c-af0b4a457d7a
   :END:
The format of the call is:
#+BEGIN_SRC lisp
(:array (query))
#+END_SRC
Example:
#+BEGIN_SRC lisp
(query (:order-by
        (:select 'r.rolename
                 (:as (:array
                       (:select 'b.rolename
                                :from (:as 'pg_catalog.pg-auth-members 'm)
                                :inner-join (:as 'pg-catalog.pg-roles 'b)
                                :on (:= 'm.roleid 'b.oid)
                                :where (:= 'm.member 'r.oid )))
                      'memberof)
                 :from (:as 'pg-catalog.pg-roles 'r))
        1))
#+END_SRC

** :array[] (declares an array and returns an array
   :PROPERTIES:
   :ID:       3dcc071b-ee57-44d0-a35c-a275615564ab
   :END:

The format of the call is:
#+BEGIN_SRC lisp
(:array[] (&rest args))
#+END_SRC
Examples:
#+BEGIN_SRC lisp
(query (:select (:array[] 2 6))
       :single)
#(2 6)

(query (:select (:array[] (:/ 15 3) (:pi) 6))
       :single)

#(5.0d0 3.141592653589793d0 6.0d0)
#+END_SRC
Note that in the second example, the value of 6 is returned as a
float because the entire array must be the same type.

** :[] (used when you want a slice of an array
   :PROPERTIES:
   :ID:       0a722d0e-eecc-4e0f-91a7-84b296ff520f
   :END:
The format of the call is:
#+BEGIN_SRC lisp
(:[] (form start &optional end))
#+END_SRC
Example:
#+BEGIN_SRC lisp
(let ((arry1 #(2 6 7 12)))
     (query (:select (:[] arry1 2 3))
            :single))

#(6 7)
#+END_SRC
