doc/array-notes.html

<div id="outline-container-org3a3f1cb" class="outline-3">
<h3 id="org3a3f1cb">Rules of Thumb - Do Not Use Arrays If:</h3>
<div class="outline-text-3" id="text-org3a3f1cb">
<ul class="org-ul">
<li>Do not use arrays where you need to maintain integrity for foreign relationships. That is what</li>
</ul>
<p>
foreign keys are for.
</p>

<ul class="org-ul">
<li>Do not use arrays if you have to change the items in the array frequently.</li>

<li>Do not use arrays if you rely on an ORM unless you have ensured</li>
</ul>
<p>
that the ORM can utilize arrays.
</p>
</div>
</div>


<div id="outline-container-org8ff0c90" class="outline-3">
<h3 id="org8ff0c90">Data Type Enforcement</h3>
<div class="outline-text-3" id="text-org8ff0c90">
<p>
Compared to jsonb, postgresql arrays enforce the data type. This can be critical in both maintaining the integrity of your data as well as optimization in your appliction code.
This database enforced type safety does not, however, enforce the dimensionality of
the array.
</p>
</div>
</div>

<div id="outline-container-orge4ec121" class="outline-3">
<h3 id="orge4ec121">Indices on Arrays</h3>
<div class="outline-text-3" id="text-orge4ec121">
<p>
It is highly recommended that you use GIN or GIST indexes to search
for items in array column. You should remember that GIST indices are
lossy while GIN indices are lossless.
</p>
</div>
</div>
</div>


<div id="outline-container-orga873376" class="outline-2">
<h2 id="orga873376">S-SQL Array Support</h2>
<div class="outline-text-2" id="text-orga873376">
<p>
S-sql can feel a little messy with respect to arrays but that
is in large part because (a) sql dealing with arrays is messy and
(b) postgresql has both an array[] constructor and an array function.
</p>

<p>
If you are just translating between a lisp array and a
postgresql array, then postmodern handles the data type translation
fairly easily as can be seen in the examples below.
</p>

<p>
Generally speaking, there are three base s-sql array operators
to know:
</p>
</div>

<div id="outline-container-org111d808" class="outline-3">
<h3 id="org111d808">:array (used inside a query calling a subquery, selecting into an array)</h3>
<div class="outline-text-3" id="text-org111d808">
<p>
The format of the call is:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #23d7d7;">:array</span> (query))
</pre>
</div>
<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:order-by</span>
        (<span style="color: #23d7d7;">:select</span> 'r.rolename
                 (<span style="color: #23d7d7;">:as</span> (<span style="color: #23d7d7;">:array</span>
                       (<span style="color: #23d7d7;">:select</span> 'b.rolename
                                <span style="color: #23d7d7;">:from</span> (<span style="color: #23d7d7;">:as</span> 'pg_catalog.pg-auth-members 'm)
                                <span style="color: #23d7d7;">:inner-join</span> (<span style="color: #23d7d7;">:as</span> 'pg-catalog.pg-roles 'b)
                                <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'm.roleid 'b.oid)
                                <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'm.member 'r.oid )))
                      'memberof)
                 <span style="color: #23d7d7;">:from</span> (<span style="color: #23d7d7;">:as</span> 'pg-catalog.pg-roles 'r))
        1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4725d4e" class="outline-3">
<h3 id="org4725d4e">:array[] (declares an array and returns an array</h3>
<div class="outline-text-3" id="text-org4725d4e">
<p>
The format of the call is:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #23d7d7;">:array[]</span> (<span style="color: #34cae2;">&amp;rest</span> args))
</pre>
</div>
<p>
Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array[]</span> 2 6))
       <span style="color: #23d7d7;">:single</span>)
#(2 6)

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array[]</span> (<span style="color: #23d7d7;">:/</span> 15 3) (<span style="color: #23d7d7;">:pi</span>) 6))
       <span style="color: #23d7d7;">:single</span>)

#(5.0d0 3.141592653589793d0 6.0d0)
</pre>
</div>
<p>
Note that in the second example, the value of 6 is returned as a
float because the entire array must be the same type.
</p>
</div>
</div>

<div id="outline-container-org3c67aab" class="outline-3">
<h3 id="org3c67aab">:[] (used when you want a slice of an array</h3>
<div class="outline-text-3" id="text-org3c67aab">
<p>
The format of the call is:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #23d7d7;">:[]</span> (form start <span style="color: #34cae2;">&amp;optional</span> end))
</pre>
</div>
<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">let</span> ((arry1 #(2 6 7 12)))
     (query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:[]</span> arry1 2 3))
            <span style="color: #23d7d7;">:single</span>))

#(6 7)
</pre>
</div>
</div>
</div>
