doc/array-notes.org
** General Usage Examples
   :PROPERTIES:
   :ID:       s-sql-array-general-usage-examples
   :END:
Just to make these usage examples really simple, we will use the
simplest use case version discussed above, with a tags array in a table
with the name of the item. In this case the name is the name of a
recipe and the tags are ingredients that either go in the recipe
or accompany the recipe.

First to create the table and the indexes. The index on 'name is the
default B-tree index. The index on the tags is a GIN index.

#+BEGIN_SRC sql
(query (:create-table recipes
                       ((name :type text)
                        (tags :type text[] :default "{}"))))

(query (:create-unique-index 'recipe-tags-id-name
                              :on "recipes"
                              :fields 'name))

(query (:create-index 'recipe-tags-id-tags
                       :on "recipes"
                       :using gin
                       :fields 'tags))
#+END_SRC
Now use :insert-rows-into to populate the table. Notice we are actually
passing in lisp arrays and it is automatically inserted in the table
as a postgresql array.
#+BEGIN_SRC lisp
(query (:insert-rows-into
        'recipes
        :columns 'name 'tags
        :values
        '(("Fattoush" #("greens" "pita bread" "olive oil" "garlic" "lemon" "salt" "spices"))
          ("Shawarma" #("meat" "tahini sauce" "pita bread"))
          ("Baba Ghanoush" #("pita bread" "olive oil" "eggplant" "tahini sauce"))
          ("Shish Taouk" #("chicken" "lemon juice" "garlic" "paprika" "yogurt" "tomato paste" "pita bread"))
          ("Kibbe nayeh" #("raw meat" "bulgur" "onion" "spices" "pita bread"))
          ("Manakeesh" #("meat" "cheese" "zaatar" "kishik" "tomatoes" "cucumbers" "mint leaves" "olives"))
          ("Fakafek" #("chickpeas" "pita bread" "tahini sauce"))
          ("Tabbouleh" #("bulgur" "tomatoes" "onions" "parsley"))
          ("Kofta" #("minced meat" "parsley" "spices" "onions"))
          ("Kunafeh" #("cheese" "sugar syrup" "pistachios"))
          ("Baklava" #("filo dough" "honey" "nuts")))))
#+END_SRC

This will automatically insert the required square brackets into the sql statement
being passed to postgresql. This automatic translation between lisp and
postgresql arrays does not work where you need a postgresql function in a query.
(The database function is not going to be in a lisp array.)
For that you need to use the :array[] sql-op. E.g.

Sample desired sql statement:
#+BEGIN_SRC sql
(SELECT ARRAY[(1 / 2)]::FLOATS[]);
#+END_SRC
S-sql version
#+BEGIN_SRC lisp
(query (:select (:type (:array[] (:/ 1 2)) float[])))
#+END_SRC

First we can start by checking for records that have a specific tag
#+BEGIN_SRC lisp
(query (:select 'recipe-id 'tags
                :from 'recipe-tags-array
                :where (:@> 'tags
                            (:array[] "bulgur"))))
(("Tabbouleh" #("bulgur" "tomatoes" "onions" "parsley"))
 ("Kibbe nayeh" #("raw meat" "bulgur" "onions" "spices" "pita bread")))

#+END_SRC
We should look at this return a bit closer. As you might expect in postmodern,
this query returns list of lists and each sublist contains the string name.
What may be unexpected is that the second item in each sublist is actually
a lisp array.

Extending this to checking for items with two specific tags:
#+BEGIN_SRC lisp
(query (:select 'recipe-id 'tags
                :from 'recipe-tags-array
                :where (:@> 'tags
                            (:array[] "bulgur" "parsley"))))

(("Tabbouleh" #("bulgur" "tomatoes" "onions" "parsley")))
#+END_SRC
As you should expect, we can also pass in a lisp variable which
is an array, in this case we are using the :&& operator which
acts as an 'or' logical test:
#+BEGIN_SRC lisp
(let ((tst-arry #("parsley" "cheese")))
  (query (:order-by (:select '*
                             :from 'recipes
                             :where (:&& 'tags tst-arry))
                    'name)))
'(("Manakeesh"
   #("meat" "cheese" "zaatar" "kishik" "tomatoes" "cucumbers" "mint leaves"
     "olives"))
  ("Tabbouleh" #("bulgur" "tomatoes" "onions" "parsley"))
  ("Kofta" #("minced meat" "parsley" "spices" "onions"))
  ("Kunafeh" #("cheese" "sugar syrup" "pistachios")))

#+END_SRC


Validating that this is returning a vector:
#+BEGIN_SRC lisp
(type-of (query (:select 'tags
                         :from 'recipes
                         :where (:= 'name "Manakeesh"))
                :single))

'(SIMPLE-VECTOR 8)
#+END_SRC
We can also check the length of the array or cardinality:
#+BEGIN_SRC lisp
(query (:select (:cardinality 'tags)
                :from 'recipes
                :where (:= 'name "Manakeesh"))
       :single)
#+END_SRC

Updating the array can be done either explicitly:
#+BEGIN_SRC lisp
;;; Update array with an lisp array (changing onion to onions in the one row where it is singular
(query (:update 'recipes
                :set 'tags #("raw meat" "bulgur" "onions" "spices" "pita bread")
                :where (:= 'name "Kibbe nayeh")))
#+END_SRC
or passing in a lisp variable:
#+BEGIN_SRC lisp
;;; checking passing a lisp array as a variable
(let ((lisp-arry #("wine" "garlic" "soy sauce")))
  (query (:update 'recipes
                  :set 'tags '$1
                  :where (:= 'name 11))
         lisp-arry))
#+END_SRC

If you are selecting a slice of a postgresql array, then use :[].
At this point it is a good reminder that postgresql arrays start
at 1, not at 0. The first parameter following the field name is
the starting point of the slice to return. The second parameter
is the end point of the slice to return (defaulting to the
starting point).

#+BEGIN_SRC lisp
(query (:select (:[] 'tags 2)
                :from 'recipes
                :where (:= 'name 3)))

'(("olive oil"))

(query (:select (:[] 'tags 2 3)
                :from 'recipes
                :where (:= 'name 3)))

'((#("olive oil" "eggplant")))

#+END_SRC
If you are sub-selecting into a postgresql array, postgresql switches
from square brackets to parens, so in s-sql you need to
use :array. E.g.

Sample desired sql statement:
#+BEGIN_SRC sql

SELECT r.rolname,
  ARRAY(SELECT b.rolname
        FROM pg_catalog.pg_auth_members m
        JOIN pg_catalog.pg_roles b ON (m.roleid = b.oid)
        WHERE m.member = r.oid) as memberof
FROM pg_catalog.pg_roles r
ORDER BY 1;
**************************
#+END_SRC

And now the s-sql version. Here, because we are selecting into an array,
we need to use just :array
#+BEGIN_SRC lisp
(query (:order-by
        (:select 'r.rolename
                 (:as (:array
                       (:select 'b.rolename
                                :from (:as 'pg_catalog.pg-auth-members 'm)
                                :inner-join (:as 'pg-catalog.pg-roles 'b)
                                :on (:= 'm.roleid 'b.oid)
                                :where (:= 'm.member 'r.oid )))
                      'memberof)
                 :from (:as 'pg-catalog.pg-roles 'r))
        1))
#+END_SRC

The postgresql unnest function (:unnest ..)  expands every
array entry into a separate row. In the following select, we pull out all
the distinct tags in a list of lists where every list has a single tag entry.
#+BEGIN_SRC lisp
(query (:order-by
        (:select (:as (:unnest 'tags) 'tag) :distinct
                 :from 'recipes)
        'tag))

'(("bulgur") ("cheese") ("chicken") ("chickpeas") ("cucumbers") ("eggplant")
  ("filo dough") ("garlic") ("greens") ("honey") ("kishik") ("lemon")
  ("lemon juice") ("meat") ("minced meat") ("mint leaves") ("nuts")
  ("olive oil") ("olives") ("onions") ("paprika") ("parsley")
  ("pistachios") ("pita bread") ("raw meat") ("salt") ("spices") ("sugar syrup")
  ("tahini sauce") ("tomatoes") ("tomato paste") ("yogurt") ("zaatar"))
#+END_SRC

We can use with and group-by operators to count the unique tags:
#+BEGIN_SRC lisp
(query (:order-by
        (:with
         (:as 'p
              (:select (:as (:unnest 'tags) 'tag)
                       :from 'recipes))
         (:select 'tag (:as (:count 'tag) 'cnt)
                  :from 'p
                  :group-by 'tag))
        (:desc 'cnt) 'tag))
'(("pita bread" 6) ("onions" 3) ("spices" 3) ("tahini sauce" 3) ("bulgur" 2)
  ("cheese" 2) ("garlic" 2) ("meat" 2) ("olive oil" 2) ("parsley" 2)
  ("tomatoes" 2) ("chicken" 1) ("chickpeas" 1) ("cucumbers" 1) ("eggplant" 1)
  ("filo dough" 1) ("greens" 1) ("honey" 1) ("kishik" 1) ("lemon" 1)
  ("lemon juice" 1) ("minced meat" 1) ("mint leaves" 1) ("nuts" 1) ("olives" 1)
  ("paprika" 1) ("pistachios" 1) ("raw meat" 1) ("salt" 1) ("sugar syrup" 1)
  ("tomato paste" 1) ("yogurt" 1) ("zaatar" 1))
#+END_SRC

Yes, there are array-append, array-replace etc operators
#+BEGIN_SRC lisp
(query (:update 'recipes
                :set 'tags (:array-append 'tags "appended-items")
                :where (:= 'name "Kibbe nayeh")))

(query (:update 'recipes
                :set 'tags (:array-replace 'tags "spices" "chocolate")))
#+END_SRC
The above two versions checked all the row, even those without the target string,
effectively the equivalent of not using the index.

You can use a different operator that more effectively uses the GIN index and
just touches the rows with the targeted string in the array:
#+BEGIN_SRC lisp
(query (:update 'recipes
                :set 'tags (:array-replace 'tags  "chocolate" "spices")
                :where (:<@ "{\"chocolate\"}" 'tags)))
#+END_SRC

The use of the :any* operator needs to be considered as a special case. Quoting
Marijn Haverbeke here,"Postgres has both a function-call-style any and an infix any,
and S-SQL's syntax doesn't allow them to be distinguished." As a result, s-sql
has a regular :any sql-op and a :any* sql-op, which expand slightly differently.

To show the difference, look at the sql statements that are generated by the two
operators :any* and :any
#+BEGIN_SRC lisp
(sql (:select '*
                :from 'recipes
                :where (:= "chicken" (:any* 'tags ))))

"(SELECT * FROM recipes WHERE (E'chicken' = ANY(tags)))"

(sql (:select '*
                :from 'recipes
                :where (:= "chicken" (:any 'tags ))))

"(SELECT * FROM recipes WHERE (E'chicken' = ANY tags))"
#+END_SRC

In the following two cases we want to use ':any*'. In the first simple query,
we are looking for everything in the rows where the name of the recipe is in
the lisp array we passed in.

In the second query we look for all the rows where the string "chicken"
appears in any of the tag arrays.
#+BEGIN_SRC lisp
(query (:select '*
                :from 'recipes
                :where (:= 'name (:any* '$1)))
       #("Trout" "Shish Taouk" "Hamburger"))

'(("Shish Taouk"
   #("chicken" "lemon juice" "garlic" "paprika" "yogurt" "tomato paste"
     "pita bread")))

(query (:select '*
                :from 'recipes
                :where (:= '$1 (:any* 'tags )))
       "chicken")

'(("Shish Taouk"
   #("chicken" "lemon juice" "garlic" "paprika" "yogurt" "tomato paste"
     "pita bread")))
#+END_SRC

We can look for rows where x or y is found in the tags array. This uses
the or operator which looks like :&&.
#+BEGIN_SRC lisp
(query (:order-by
        (:select '*
                 :from 'recipes
                 :where (:&& 'tags (:array[] '$1 '$2)))
        'name)
       "parsley" "cheese")
'(("Manakeesh"
   #("meat" "cheese" "zaatar" "kishik" "tomatoes" "cucumbers" "mint leaves"
     "olives"))
  ("Tabbouleh" #("bulgur" "tomatoes" "onions" "parsley"))
  ("Kofta" #("minced meat" "parsley" "spices" "onions"))
  ("Kunafeh" #("cheese" "sugar syrup" "pistachios")))
#+END_SRC

There are also specific operators for "contains" (:@>) and "contained-by" (:<@).
This comparison is done on an element by element basis, so is easily
thought of as whether the elements in array1 are a subset of the elements
in array2 or vice versa.

The following examples should be easy to follow.

In the first example we are looking for rows where the elements of an
array composed of the two strings passed in as parameters is contained
by the row in the database.

In the second example, we have flipped the parameters and operator around.
We are looking for rows from the database table which contain the elements
of an array composed of the two strings passed in as parameters.
#+BEGIN_SRC lisp
(query (:order-by
        (:select '* :from 'recipes
                 :where (:<@ (:array[] '$1 '$2)
                             'tags))
        'name)
       "tomatoes" "cheese")

'(("Manakeesh"
   #("meat" "cheese" "zaatar" "kishik" "tomatoes" "cucumbers" "mint leaves"
     "olives")))

(query (:order-by
        (:select '* :from 'recipes
                 :where (:@> 'tags
                             (:array[] '$1 '$2)))
        'name)
       "tomatoes" "cheese")

'(("Manakeesh"
   #("meat" "cheese" "zaatar" "kishik" "tomatoes" "cucumbers" "mint leaves"
     "olives")))
#+END_SRC
In the following two examples, we do something similar, but we are looking
to see if the tags array in any row in the database table is a subset of
the small two element array we are passing in. The answer is nil.

#+BEGIN_SRC lisp
(query (:order-by
        (:select '* :from 'recipes
                 :where (:@> (:array[] '$1 '$2)
                             'tags))
        'name)
       "tomatoes" "cheese")

nil

(query (:order-by
        (:select '* :from 'recipes
                 :where (:<@ 'tags
                             (:array[] '$1 '$2)))
        'name)
       "tomatoes" "cheese")

nil
#+END_SRC
