doc/array-notes.org
* Dao Class Support for Arrays
  :PROPERTIES:
  :ID:       dao-class-support
  :END:
* Array Operators
  :PROPERTIES:
  :ID:       array-operators
  :END:
** Array Comparison Operators
   :PROPERTIES:
   :ID:       array-comparison-operators
   :END:

Per postgresql [[https://www.postgresql.org/docs/current/static/functions-array.html][documentation]] array comparisons compare the array contents
element-by-element,  using the default B-tree comparison function for the
element data type. In multidimensional arrays the elements are visited in
row-major order (last subscript varies most rapidly). If the contents of
two arrays are equal but the dimensionality is different, the first
difference in the dimensionality information determines the sort order.

Form is (:operator array1 array2)
*** := Equality Comparison (Are two arrays equal on an element by element basis)
    :PROPERTIES:
    :ID:       910e5102-1caf-4500-a058-5ea73d4195fb
    :END:
#+BEGIN_SRC lisp
(query (:select (:= (:array[] 1 2 3) (:array[] 1 2 3)))
       :single)
T

(query (:select (:= (:array[] "a" "b" "c") (:array[] "a" "b" "c")))
       :single)
T

(query (:select (:= (:type (:array[] 1 2 3) integer[]) (:array[] 1 2 3)))
       :single)
T

(query (:select (:= (:array[] 1 2 3) (:array[] 1 4 3)))
       :single)
nil

(query (:select (:= (:type (:array[] 1 2 3) integer[]) (:array[] 1 2 3 5)))
       :single)

nil

(let ((arry1 #(1 2 3)) (arry2 #(1 2 3)))
  (query (:select (:= arry1 arry2))
         :single))
T
#+END_SRC

*** :<> Not Equal Comparison
    :PROPERTIES:
    :ID:       8c06e52c-51c1-458c-9c98-f3cf78bfb607
    :END:
#+BEGIN_SRC lisp
(query (:select (:<> (:array[] 1 2 3) (:array[] 1 2 4)))
       :single)
T
#+END_SRC

*** :< Less Than Comparison
    :PROPERTIES:
    :ID:       8a4aa8ad-19e0-49a7-b663-64c9a1ff774c
    :END:
#+BEGIN_SRC lisp
(query (:select (:< (:array[] 1 2 3) (:array[] 1 2 4)))
       :single)
T
#+END_SRC

*** :> Greater Than Comparison
    :PROPERTIES:
    :ID:       cbda93e7-0808-45de-bccb-00b0fc7ea4de
    :END:
#+BEGIN_SRC lisp
(query (:select (:> (:array[] 1 4 3) (:array[] 1 2 4)))
       :single)
T
#+END_SRC

*** :>= Greater Than or Equal to Comparison
    :PROPERTIES:
    :ID:       a99f6cf1-a223-40f6-9754-bf1752d7ee20
    :END:
#+BEGIN_SRC lisp
(query (:select (:>= (:array[] 1 4 3) (:array[] 1 4 3)))
       :single)
T
#+END_SRC

*** :<= Less Than or Equal To Comparison
    :PROPERTIES:
    :ID:       fe0f92a9-46c8-4cce-b0ad-ebd8a40dd263
    :END:
#+BEGIN_SRC lisp
(query (:select (:<= (:array[] 1 2 3) (:array[] 1 2 3)))
       :single)
T
#+END_SRC

*** :@> Contains Comparison
    :PROPERTIES:
    :ID:       dd3157d0-102c-4081-9010-41e6e5ccfa8c
    :END:
#+BEGIN_SRC lisp
(query (:select (:@> (:array[] 1 4 3) (:array[] 3 1)))
       :single)
T

(query (:select (:@> (:array[] 1 4 73) (:array[] 3 0)))
       :single)
nil
#+END_SRC
*** :<@ Is Contained By Comparison
    :PROPERTIES:
    :ID:       baff641b-062f-44c1-9c33-7893d5aa2d21
    :END:
#+BEGIN_SRC lisp
(query (:select (:<@ (:array[] 2 7) (:array[] 1 7 4 2 6)))
        :single)
T

(query (:select (:<@ (:array[] 1 4 3) (:array[] 3 1)))
       :single)
nil
#+END_SRC
*** :&& Has Elements in Common Comparison
    :PROPERTIES:
    :ID:       8ad2296d-d7cd-4c09-be8d-06c733d8da86
    :END:
#+BEGIN_SRC lisp
(query (:select (:&& (:array[] 1 4 3) (:array[] 3 1)))
       :single)
T
#+END_SRC

** Array Concatenation Operators
   :PROPERTIES:
   :ID:       71720f76-3818-4944-b888-ef02066b56cd
   :END:
Form (:|| item1 item2 ...)
*** :|| Concatentation Arrays and Elements
    :PROPERTIES:
    :ID:       758384d1-31b8-497b-becb-45bccdd9af5d
    :END:
#+BEGIN_SRC lisp
(query (:select (:|| 3 (:array[] 4 5 6)))
       :single)

#(3 4 5 6)

(query (:select (:|| (:array[] 4 5 6) 7))
       :single)

#(4 5 6 7)

(query (:select (:|| (:array[] 1 2) (:array[] 3 4)))
       :single)

#(1 2 3 4)

(query (:select (:|| 1 (:type "[0:1]={2,3}" int[])))
       :single)

#(1 2 3)

(query (:select (:|| 3 (:array[] 4 5 6) (:array[] 7 8 9) 10))
       :single)
#(3 4 5 6 7 8 9 10)
#+END_SRC

*** :|| Concatenation with Multi-Dimensional Arrays
    :PROPERTIES:
    :ID:       4951181f-0265-4a05-aea4-e4209329cdaa
    :END:

#+BEGIN_SRC lisp
(query (:select (:|| (:array[] 1 2 3) (:array[] (:array[] 4 5 6) (:array[] 7 8 9))))
       :single)

#2A((1 2 3) (4 5 6) (7 8 9))
#+END_SRC

* Array functions
  :PROPERTIES:
  :ID:       d996285a-d3ef-4939-8545-f18ca5297a7d
  :END:

*** Array-prepend
    :PROPERTIES:
    :ID:       b5658fbf-ff9b-4814-bb74-673726943403
    :END:
Form: (:array-prepend (array1 element))
Appends an element to the beginning of an array
#+BEGIN_SRC lisp
(query (:select (:array-prepend 1 (:array[] 2 3)))
       :single)

#(1 2 3)
#+END_SRC

