doc/array-notes.html
<div id="outline-container-org826cf7c" class="outline-2">
<h2 id="org826cf7c">Dao Class Support for Arrays</h2>
<div class="outline-text-2" id="text-org826cf7c">
</div>
</div>
<div id="outline-container-org51f254c" class="outline-2">
<h2 id="org51f254c">Array Operators</h2>
<div class="outline-text-2" id="text-org51f254c">
</div>
<div id="outline-container-org269876e" class="outline-3">
<h3 id="org269876e">Array Comparison Operators</h3>
<div class="outline-text-3" id="text-org269876e">
<p>
Per postgresql <a href="https://www.postgresql.org/docs/current/static/functions-array.html">documentation</a> array comparisons compare the array contents
element-by-element,  using the default B-tree comparison function for the
element data type. In multidimensional arrays the elements are visited in
row-major order (last subscript varies most rapidly). If the contents of
two arrays are equal but the dimensionality is different, the first
difference in the dimensionality information determines the sort order.
</p>

<p>
Form is (:operator array1 array2)
</p>
</div>
<div id="outline-container-org9047d71" class="outline-4">
<h4 id="org9047d71">:= Equality Comparison (Are two arrays equal on an element by element basis)</h4>
<div class="outline-text-4" id="text-org9047d71">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:=</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 1 2 3)))
       <span style="color: #23d7d7;">:single</span>)
T

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:=</span> (<span style="color: #23d7d7;">:array[]</span> <span style="color: #e67128;">"a"</span> <span style="color: #e67128;">"b"</span> <span style="color: #e67128;">"c"</span>) (<span style="color: #23d7d7;">:array[]</span> <span style="color: #e67128;">"a"</span> <span style="color: #e67128;">"b"</span> <span style="color: #e67128;">"c"</span>)))
       <span style="color: #23d7d7;">:single</span>)
T

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:=</span> (<span style="color: #23d7d7;">:type</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) integer[]) (<span style="color: #23d7d7;">:array[]</span> 1 2 3)))
       <span style="color: #23d7d7;">:single</span>)
T

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:=</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 1 4 3)))
       <span style="color: #23d7d7;">:single</span>)
nil

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:=</span> (<span style="color: #23d7d7;">:type</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) integer[]) (<span style="color: #23d7d7;">:array[]</span> 1 2 3 5)))
       <span style="color: #23d7d7;">:single</span>)

nil

(<span style="color: #ffad29; font-weight: bold;">let</span> ((arry1 #(1 2 3)) (arry2 #(1 2 3)))
  (query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:=</span> arry1 arry2))
         <span style="color: #23d7d7;">:single</span>))
T
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c80249" class="outline-4">
<h4 id="org1c80249">:&lt;&gt; Not Equal Comparison</h4>
<div class="outline-text-4" id="text-org1c80249">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&lt;&gt;</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 1 2 4)))
       <span style="color: #23d7d7;">:single</span>)
T
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fe0011" class="outline-4">
<h4 id="org3fe0011">:&lt; Less Than Comparison</h4>
<div class="outline-text-4" id="text-org3fe0011">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&lt;</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 1 2 4)))
       <span style="color: #23d7d7;">:single</span>)
T
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcda6285" class="outline-4">
<h4 id="orgcda6285">:&gt; Greater Than Comparison</h4>
<div class="outline-text-4" id="text-orgcda6285">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&gt;</span> (<span style="color: #23d7d7;">:array[]</span> 1 4 3) (<span style="color: #23d7d7;">:array[]</span> 1 2 4)))
       <span style="color: #23d7d7;">:single</span>)
T
</pre>
</div>
</div>
</div>

<div id="outline-container-org343dd7c" class="outline-4">
<h4 id="org343dd7c">:&gt;= Greater Than or Equal to Comparison</h4>
<div class="outline-text-4" id="text-org343dd7c">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&gt;=</span> (<span style="color: #23d7d7;">:array[]</span> 1 4 3) (<span style="color: #23d7d7;">:array[]</span> 1 4 3)))
       <span style="color: #23d7d7;">:single</span>)
T
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d854a7" class="outline-4">
<h4 id="org0d854a7">:&lt;= Less Than or Equal To Comparison</h4>
<div class="outline-text-4" id="text-org0d854a7">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&lt;=</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 1 2 3)))
       <span style="color: #23d7d7;">:single</span>)
T
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb938b5" class="outline-4">
<h4 id="orgeb938b5">:@&gt; Contains Comparison</h4>
<div class="outline-text-4" id="text-orgeb938b5">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:@&gt;</span> (<span style="color: #23d7d7;">:array[]</span> 1 4 3) (<span style="color: #23d7d7;">:array[]</span> 3 1)))
       <span style="color: #23d7d7;">:single</span>)
T

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:@&gt;</span> (<span style="color: #23d7d7;">:array[]</span> 1 4 73) (<span style="color: #23d7d7;">:array[]</span> 3 0)))
       <span style="color: #23d7d7;">:single</span>)
nil
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa75fef" class="outline-4">
<h4 id="orgfa75fef">:&lt;@ Is Contained By Comparison</h4>
<div class="outline-text-4" id="text-orgfa75fef">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&lt;@</span> (<span style="color: #23d7d7;">:array[]</span> 2 7) (<span style="color: #23d7d7;">:array[]</span> 1 7 4 2 6)))
        <span style="color: #23d7d7;">:single</span>)
T

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&lt;@</span> (<span style="color: #23d7d7;">:array[]</span> 1 4 3) (<span style="color: #23d7d7;">:array[]</span> 3 1)))
       <span style="color: #23d7d7;">:single</span>)
nil
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f73a5a" class="outline-4">
<h4 id="org7f73a5a">:&amp;&amp; Has Elements in Common Comparison</h4>
<div class="outline-text-4" id="text-org7f73a5a">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:&amp;&amp;</span> (<span style="color: #23d7d7;">:array[]</span> 1 4 3) (<span style="color: #23d7d7;">:array[]</span> 3 1)))
       <span style="color: #23d7d7;">:single</span>)
T
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdbea427" class="outline-3">
<h3 id="orgdbea427">Array Concatenation Operators</h3>
<div class="outline-text-3" id="text-orgdbea427">
<p>
Form (:|| item1 item2 &#x2026;)
</p>
</div>
<div id="outline-container-org7645780" class="outline-4">
<h4 id="org7645780">:|| Concatentation Arrays and Elements</h4>
<div class="outline-text-4" id="text-org7645780">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (:|| 3 (<span style="color: #23d7d7;">:array[]</span> 4 5 6)))
       <span style="color: #23d7d7;">:single</span>)

#(3 4 5 6)

(query (<span style="color: #23d7d7;">:select</span> (:|| (<span style="color: #23d7d7;">:array[]</span> 4 5 6) 7))
       <span style="color: #23d7d7;">:single</span>)

#(4 5 6 7)

(query (<span style="color: #23d7d7;">:select</span> (:|| (<span style="color: #23d7d7;">:array[]</span> 1 2) (<span style="color: #23d7d7;">:array[]</span> 3 4)))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 3 4)

(query (<span style="color: #23d7d7;">:select</span> (:|| 1 (<span style="color: #23d7d7;">:type</span> <span style="color: #e67128;">"[0:1]={2,3}"</span> int[])))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 3)

(query (<span style="color: #23d7d7;">:select</span> (:|| 3 (<span style="color: #23d7d7;">:array[]</span> 4 5 6) (<span style="color: #23d7d7;">:array[]</span> 7 8 9) 10))
       <span style="color: #23d7d7;">:single</span>)
#(3 4 5 6 7 8 9 10)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2faadb" class="outline-4">
<h4 id="orge2faadb">:|| Concatenation with Multi-Dimensional Arrays</h4>
<div class="outline-text-4" id="text-orge2faadb">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (:|| (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> (<span style="color: #23d7d7;">:array[]</span> 4 5 6) (<span style="color: #23d7d7;">:array[]</span> 7 8 9))))
       <span style="color: #23d7d7;">:single</span>)

#2A((1 2 3) (4 5 6) (7 8 9))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org4ae78e1" class="outline-2">
<h2 id="org4ae78e1">Array functions</h2>
<div class="outline-text-2" id="text-org4ae78e1">
</div>

<div id="outline-container-org2774760" class="outline-4">
<h4 id="org2774760">Array-prepend</h4>
<div class="outline-text-4" id="text-org2774760">
<p>
Form: (:array-prepend (array1 element))
Appends an element to the beginning of an array
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-prepend</span> 1 (<span style="color: #23d7d7;">:array[]</span> 2 3)))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 3)
</pre>
</div>
</div>
</div>
