doc/array-notes.org
*** array-append
    :PROPERTIES:
    :ID:       29d053f7-0758-4665-a06e-70c6c1b13bd3
    :END:
Form: (:array-append (array1 element))
Appends an element to the end of an array.
#+BEGIN_SRC lisp
(query (:select (:array-append (:array[] 4 5 6) 7))
       :single)

#(4 5 6 7)
#+END_SRC

*** array-cat
    :PROPERTIES:
    :ID:       97260c82-8771-4d22-8b68-108d833ea562
    :END:
Form: (:array-cat (array1 array2))
Concatenates two arrays. No more, no less. Both arrays need to have the same
data type. They do not need to be the same length.
#+BEGIN_SRC lisp
(query (:select (:array-cat (:array[] 1 2) (:array[] 3 4)))
       :single)

#(1 2 3 4)

(query (:select (:array-cat (:array[] (:array[] 1 2) (:array[] 3 4)) (:array[] 5 6)))
       :single)

#2A((1 2) (3 4) (5 6))

(query (:select (:array-cat (:array[] 1 2) (:array[] 3 4 5)))
       :single)

#(1 2 3 4 5)
#+END_SRC

*** array-ndims
    :PROPERTIES:
    :ID:       e09f0fe0-a195-4850-9c33-45468f8b2161
    :END:
Form: (:array-ndims (array))
Array-ndims returns the number of dimensions of an array.
#+BEGIN_SRC lisp
(query (:select (:array-ndims (:array[] (:array[] 1 2 3) (:array[] 4 5 6))))
       :single)
2
#+END_SRC

*** array-dims
    :PROPERTIES:
    :ID:       5c5d76f9-a8be-4755-bc80-c11df01ab527
    :END:
Form: (:array-dims (array1))
Array-dims returns a text representation of an array's dimensions.
#+BEGIN_SRC lisp
(query (:select (:array-dims (:array[] (:array[] 1 2 3) (:array[] 4 5 6))))
       :single)
"[1:2][1:3]"
#+END_SRC

*** array-fill
    :PROPERTIES:
    :ID:       3251b989-6701-481c-a364-b004a56240d1
    :END:
Form: (:array-fill (value array-dimension))
Array-fill returns an array initialized with supplied value and length.
This only works with one dimensional arrays
#+BEGIN_SRC lisp

#+END_SRC
(query (:select (:array-fill 7 (:array[] 3)))
       :single)

#(7 7 7)
*** array-length
    :PROPERTIES:
    :ID:       884184ec-f9d0-470f-8f86-de9a41cb1691
    :END:
Form: (:array-length (array1 array-dimension))
Returns the length of the requested array dimension.
In the following example, we request the first array
dimension.
#+BEGIN_SRC lisp
(query (:select (:array-length (:array[] 1 2 3) 1 ))
       :single)
3

(query (:select (:array-length (:array[] #(#(1 2 3)#(4 5 6))) 1)) :single)

1

(query (:select (:array-length (:array[] #(#(1 2 3)#(4 5 6))) 2)) :single)

2
#+END_SRC

*** array-lower
    :PROPERTIES:
    :ID:       2d3bd579-9108-4ffe-8a43-b7788f4e2111
    :END:
Form: (:array-lower (&rest args))
Array-lower returns the lower bound of the requested array dimension.
#+BEGIN_SRC lisp
(query (:select (:array-lower (:type "[0:2]={1,2,3}" integer[]) 1))
       :single)
0
#+END_SRC

*** array-position
    :PROPERTIES:
    :ID:       f96bd213-ebda-4977-920a-b30cb166b48f
    :END:
Form: (:array-position (array element starting-point-if-not-one))
Array-position returns the subscript of the first occurrence of the
second argument in the array, starting at the element indicated by the third
argument or at the first element. The array must be one-dimensional.
Requires postgresql version 9.5 or newer.
#+BEGIN_SRC lisp
(query (:select (:array-position (:array[] "sun" "mon" "tue" "wed" "thu" "fri" "sat") "mon"))
       :single)
2
#+END_SRC


*** array-positions
    :PROPERTIES:
    :ID:       c4ead3ae-978b-43bb-88f0-f2aa07b717ff
    :END:
Form: (:array-positions (array element))
Array-positions (note the plural) returns an array of subscripts
of all occurrences of the second argument in the array given as
the first argument. The array must be one-dimensional.
Requires postgresql version 9.5 or newer.
#+BEGIN_SRC lisp
(query (:select (:array-positions (:array[] "A" "A" "B" "A") "A"))
       :single)

#(1 2 4)
#+END_SRC

*** array-remove
    :PROPERTIES:
    :ID:       169edd98-0d73-476a-bb45-33095e42c75e
    :END:
Form: (:array-remove (array element))
Array-remove removes all elements equal to the given value
from the array (array must be one-dimensional).
Requires postgresql 9.3 or newer.
#+BEGIN_SRC lisp
(query (:select (:array-remove (:array[] "A" "A" "B" "A") "B"))
       :single)

#("A" "A" "A")
#+END_SRC
Obviously inside a selection query array-remove only removes the elements
from the returning set and does not change the underlying data..

*** array-replace
    :PROPERTIES:
    :ID:       e3c67116-89c4-4b4a-ae07-778dfbd31277
    :END:
Form: (:array-replace (array element-to-be-replaced element-used-as-replacement))
Array-replaces replaces each array element equal to the given value
with a new value. Requires postgresql 9.3 or newer.
#+BEGIN_SRC lisp
(query (:select (:array-replace (:array[] 1 2 5 4) 5 3))
       :single)

#(1 2 3 4)
#+END_SRC

*** array-to-string
    :PROPERTIES:
    :ID:       1d234967-cff1-42df-82ab-207347f9a716
    :END:
Form: (:array-to-string (array delimiter optional-null-string))
Array-to-string concatenates array elements using supplied
delimiter and optional null string.
#+BEGIN_SRC lisp
(query (:select (:array-to-string (:array[] 1 2 3 :NULL 5) "," "*"))
       :single)

"1,2,3,*,5"
#+END_SRC


*** array-upper
    :PROPERTIES:
    :ID:       282b5cb0-a689-469b-872a-a6db2027090e
    :END:
Form: (:array-upper (array int))
Array-upper returns upper bound of the requested array dimension.
#+BEGIN_SRC lisp
(query (:select (:array-upper (:array[] 1 8 3 7) 1))
       :single)
4
#+END_SRC

