doc/array-notes.html

<div id="outline-container-org553460c" class="outline-4">
<h4 id="org553460c">array-append</h4>
<div class="outline-text-4" id="text-org553460c">
<p>
Form: (:array-append (array1 element))
Appends an element to the end of an array.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-append</span> (<span style="color: #23d7d7;">:array[]</span> 4 5 6) 7))
       <span style="color: #23d7d7;">:single</span>)

#(4 5 6 7)
</pre>
</div>
</div>
</div>

<div id="outline-container-org358241c" class="outline-4">
<h4 id="org358241c">array-cat</h4>
<div class="outline-text-4" id="text-org358241c">
<p>
Form: (:array-cat (array1 array2))
Concatenates two arrays. No more, no less. Both arrays need to have the same
data type. They do not need to be the same length.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-cat</span> (<span style="color: #23d7d7;">:array[]</span> 1 2) (<span style="color: #23d7d7;">:array[]</span> 3 4)))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 3 4)

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-cat</span> (<span style="color: #23d7d7;">:array[]</span> (<span style="color: #23d7d7;">:array[]</span> 1 2) (<span style="color: #23d7d7;">:array[]</span> 3 4)) (<span style="color: #23d7d7;">:array[]</span> 5 6)))
       <span style="color: #23d7d7;">:single</span>)

#2A((1 2) (3 4) (5 6))

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-cat</span> (<span style="color: #23d7d7;">:array[]</span> 1 2) (<span style="color: #23d7d7;">:array[]</span> 3 4 5)))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 3 4 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbef29fc" class="outline-4">
<h4 id="orgbef29fc">array-ndims</h4>
<div class="outline-text-4" id="text-orgbef29fc">
<p>
Form: (:array-ndims (array))
Array-ndims returns the number of dimensions of an array.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-ndims</span> (<span style="color: #23d7d7;">:array[]</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 4 5 6))))
       <span style="color: #23d7d7;">:single</span>)
2
</pre>
</div>
</div>
</div>

<div id="outline-container-org34dc0b7" class="outline-4">
<h4 id="org34dc0b7">array-dims</h4>
<div class="outline-text-4" id="text-org34dc0b7">
<p>
Form: (:array-dims (array1))
Array-dims returns a text representation of an array's dimensions.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-dims</span> (<span style="color: #23d7d7;">:array[]</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) (<span style="color: #23d7d7;">:array[]</span> 4 5 6))))
       <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"[1:2][1:3]"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c9eb36" class="outline-4">
<h4 id="org1c9eb36">array-fill</h4>
<div class="outline-text-4" id="text-org1c9eb36">
<p>
Form: (:array-fill (value array-dimension))
Array-fill returns an array initialized with supplied value and length.
This only works with one dimensional arrays
</p>
<div class="org-src-container">
<pre class="src src-lisp">
</pre>
</div>
<p>
(query (:select (:array-fill 7 (:array[] 3)))
       :single)
</p>

<p>
#(7 7 7)
</p>
</div>
</div>
<div id="outline-container-org102910e" class="outline-4">
<h4 id="org102910e">array-length</h4>
<div class="outline-text-4" id="text-org102910e">
<p>
Form: (:array-length (array1 array-dimension))
Returns the length of the requested array dimension.
In the following example, we request the first array
dimension.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-length</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) 1 ))
       <span style="color: #23d7d7;">:single</span>)
3

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-length</span> (<span style="color: #23d7d7;">:array[]</span> #(#(1 2 3)#(4 5 6))) 1)) <span style="color: #23d7d7;">:single</span>)

1

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-length</span> (<span style="color: #23d7d7;">:array[]</span> #(#(1 2 3)#(4 5 6))) 2)) <span style="color: #23d7d7;">:single</span>)

2
</pre>
</div>
</div>
</div>

<div id="outline-container-org5974698" class="outline-4">
<h4 id="org5974698">array-lower</h4>
<div class="outline-text-4" id="text-org5974698">
<p>
Form: (:array-lower (&amp;rest args))
Array-lower returns the lower bound of the requested array dimension.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-lower</span> (<span style="color: #23d7d7;">:type</span> <span style="color: #e67128;">"[0:2]={1,2,3}"</span> integer[]) 1))
       <span style="color: #23d7d7;">:single</span>)
0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5bc7b2" class="outline-4">
<h4 id="orgc5bc7b2">array-position</h4>
<div class="outline-text-4" id="text-orgc5bc7b2">
<p>
Form: (:array-position (array element starting-point-if-not-one))
Array-position returns the subscript of the first occurrence of the
second argument in the array, starting at the element indicated by the third
argument or at the first element. The array must be one-dimensional.
Requires postgresql version 9.5 or newer.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-position</span> (<span style="color: #23d7d7;">:array[]</span> <span style="color: #e67128;">"sun"</span> <span style="color: #e67128;">"mon"</span> <span style="color: #e67128;">"tue"</span> <span style="color: #e67128;">"wed"</span> <span style="color: #e67128;">"thu"</span> <span style="color: #e67128;">"fri"</span> <span style="color: #e67128;">"sat"</span>) <span style="color: #e67128;">"mon"</span>))
       <span style="color: #23d7d7;">:single</span>)
2
</pre>
</div>
</div>
</div>


<div id="outline-container-org5ae7695" class="outline-4">
<h4 id="org5ae7695">array-positions</h4>
<div class="outline-text-4" id="text-org5ae7695">
<p>
Form: (:array-positions (array element))
Array-positions (note the plural) returns an array of subscripts
of all occurrences of the second argument in the array given as
the first argument. The array must be one-dimensional.
Requires postgresql version 9.5 or newer.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-positions</span> (<span style="color: #23d7d7;">:array[]</span> <span style="color: #e67128;">"A"</span> <span style="color: #e67128;">"A"</span> <span style="color: #e67128;">"B"</span> <span style="color: #e67128;">"A"</span>) <span style="color: #e67128;">"A"</span>))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 4)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0923f75" class="outline-4">
<h4 id="org0923f75">array-remove</h4>
<div class="outline-text-4" id="text-org0923f75">
<p>
Form: (:array-remove (array element))
Array-remove removes all elements equal to the given value
from the array (array must be one-dimensional).
Requires postgresql 9.3 or newer.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-remove</span> (<span style="color: #23d7d7;">:array[]</span> <span style="color: #e67128;">"A"</span> <span style="color: #e67128;">"A"</span> <span style="color: #e67128;">"B"</span> <span style="color: #e67128;">"A"</span>) <span style="color: #e67128;">"B"</span>))
       <span style="color: #23d7d7;">:single</span>)

#(<span style="color: #e67128;">"A"</span> <span style="color: #e67128;">"A"</span> <span style="color: #e67128;">"A"</span>)
</pre>
</div>
<p>
Obviously inside a selection query array-remove only removes the elements
from the returning set and does not change the underlying data..
</p>
</div>
</div>

<div id="outline-container-orgd824c3c" class="outline-4">
<h4 id="orgd824c3c">array-replace</h4>
<div class="outline-text-4" id="text-orgd824c3c">
<p>
Form: (:array-replace (array element-to-be-replaced element-used-as-replacement))
Array-replaces replaces each array element equal to the given value
with a new value. Requires postgresql 9.3 or newer.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-replace</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 5 4) 5 3))
       <span style="color: #23d7d7;">:single</span>)

#(1 2 3 4)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c3e8c8" class="outline-4">
<h4 id="org7c3e8c8">array-to-string</h4>
<div class="outline-text-4" id="text-org7c3e8c8">
<p>
Form: (:array-to-string (array delimiter optional-null-string))
Array-to-string concatenates array elements using supplied
delimiter and optional null string.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-to-string</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3 <span style="color: #23d7d7;">:NULL</span> 5) <span style="color: #e67128;">","</span> <span style="color: #e67128;">"*"</span>))
       <span style="color: #23d7d7;">:single</span>)

<span style="color: #e67128;">"1,2,3,*,5"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orga7d29a9" class="outline-4">
<h4 id="orga7d29a9">array-upper</h4>
<div class="outline-text-4" id="text-orga7d29a9">
<p>
Form: (:array-upper (array int))
Array-upper returns upper bound of the requested array dimension.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-upper</span> (<span style="color: #23d7d7;">:array[]</span> 1 8 3 7) 1))
       <span style="color: #23d7d7;">:single</span>)
4
</pre>
</div>
</div>
</div>
