doc/array-notes.org
*** cardinality
    :PROPERTIES:
    :ID:       b9848825-3091-4d25-bb56-99591b44cc53
    :END:
Form: (:cardinality (array))
Returns the total number of elements in the array or 0 if
the array is empty. Requires postgresql 9.4 or newer.
#+BEGIN_SRC lisp
(query (:select (:array-length (:array[] 1 2 3) 1 ))
       :single)
3
#+END_SRC

*** string-to-array
    :PROPERTIES:
    :ID:       222953ff-ed90-41c4-be62-f3c3cbd1d872
    :END:
Form: (:string-to-array (text delimiter optional-null-string))
String-to-array splits a string into array elements using
the supplied delimiter and optional null string.
#+BEGIN_SRC lisp
(query (:select (:string-to-array "xx~^~yy~^~zz" "~^~" "yy"))
       :single)

#("xx" :NULL "zz")
#+END_SRC

*** unnest
    :PROPERTIES:
    :ID:       303a7cb0-991a-4e1f-90bb-b2b1959429cf
    :END:
Form: (:unnest (array))
Unnest expands an array to a set of rows.
#+BEGIN_SRC lisp
(query (:select (:unnest (:array[] 1 2))))

'((1) (2))
#+END_SRC
It is possible to call unnest with multiple arrays, but this is only
allowed in the from clause of the query. See
[[https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-TABLEFUNCTIONS]]

*** array-agg
    :PROPERTIES:
    :ID:       34bffa57-8d73-44ea-a2b3-a50b3f8af2ff
    :END:
Form: (:array-agg (expression))
Array-agg returns the result in an array (both sql and, in postmodern, a lisp array).

Note the fourth example (available only in postgresql versions 9.4 or newer)
filters out null values.

Like all the aggregate functions, you can pass :filter, :distinct or :order-by
(in that order) as additional parameters.

#+BEGIN_SRC lisp
(query (:select (:array-agg 'name) :from 'recipes) :single)

#("Fattoush" "Shawarma" "Baba Ghanoush" "Shish Taouk" "Kibbe nayeh" "Manakeesh"
  "Fakafek" "Tabbouleh" "Kofta" "Kunafeh" "Baklava")

(query (:select (:array-agg 'city :distinct)
        :from 'employee)
  :single)

#("New York" "Toronto" "Vancouver")

(query (:select (:array-agg 'city :distinct :order-by (:desc 'city))
        :from 'employee)
  :single)

#("Vancouver" "Toronto" "New York")

(query (:select 'city (:array-agg 'salary :filter (:< 'salary 50000))
        :from 'employee
        :group-by 'city))

(("Vancouver" #(14420 26020)) ("New York" #(40420 40620)) ("Toronto" #(24020)))
#+END_SRC


** NULL and nil
   :PROPERTIES:
   :ID:       c40b6ef9-737b-4341-9ec0-73fddc7eea55
   :END:
An empty array will be returned by postmodern as nil.

[[file:s-sql.html][Return to s-sql.html]]
