doc/array-notes.html

<div id="outline-container-orgd589d9f" class="outline-4">
<h4 id="orgd589d9f">cardinality</h4>
<div class="outline-text-4" id="text-orgd589d9f">
<p>
Form: (:cardinality (array))
Returns the total number of elements in the array or 0 if
the array is empty. Requires postgresql 9.4 or newer.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-length</span> (<span style="color: #23d7d7;">:array[]</span> 1 2 3) 1 ))
       <span style="color: #23d7d7;">:single</span>)
3
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e460cd" class="outline-4">
<h4 id="org0e460cd">string-to-array</h4>
<div class="outline-text-4" id="text-org0e460cd">
<p>
Form: (:string-to-array (text delimiter optional-null-string))
String-to-array splits a string into array elements using
the supplied delimiter and optional null string.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:string-to-array</span> <span style="color: #e67128;">"xx~^~yy~^~zz"</span> <span style="color: #e67128;">"~^~"</span> <span style="color: #e67128;">"yy"</span>))
       <span style="color: #23d7d7;">:single</span>)

#(<span style="color: #e67128;">"xx"</span> <span style="color: #23d7d7;">:NULL</span> <span style="color: #e67128;">"zz"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb945cf" class="outline-4">
<h4 id="orgfb945cf">unnest</h4>
<div class="outline-text-4" id="text-orgfb945cf">
<p>
Form: (:unnest (array))
Unnest expands an array to a set of rows.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:unnest</span> (<span style="color: #23d7d7;">:array[]</span> 1 2))))

'((1) (2))
</pre>
</div>
<p>
It is possible to call unnest with multiple arrays, but this is only
allowed in the from clause of the query. See
<a href="https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-TABLEFUNCTIONS">https://www.postgresql.org/docs/current/static/queries-table-expressions.html#QUERIES-TABLEFUNCTIONS</a>
</p>
</div>
</div>

<div id="outline-container-orgae7d8cb" class="outline-4">
<h4 id="orgae7d8cb">array-agg</h4>
<div class="outline-text-4" id="text-orgae7d8cb">
<p>
Form: (:array-agg (expression))
Array-agg returns the result in an array (both sql and, in postmodern, a lisp array).
</p>

<p>
Note the fourth example (available only in postgresql versions 9.4 or newer)
filters out null values.
</p>

<p>
Like all the aggregate functions, you can pass :filter, :distinct or :order-by
(in that order) as additional parameters.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-agg</span> 'name) <span style="color: #23d7d7;">:from</span> 'recipes) <span style="color: #23d7d7;">:single</span>)

#(<span style="color: #e67128;">"Fattoush"</span> <span style="color: #e67128;">"Shawarma"</span> <span style="color: #e67128;">"Baba Ghanoush"</span> <span style="color: #e67128;">"Shish Taouk"</span> <span style="color: #e67128;">"Kibbe nayeh"</span> <span style="color: #e67128;">"Manakeesh"</span>
  <span style="color: #e67128;">"Fakafek"</span> <span style="color: #e67128;">"Tabbouleh"</span> <span style="color: #e67128;">"Kofta"</span> <span style="color: #e67128;">"Kunafeh"</span> <span style="color: #e67128;">"Baklava"</span>)

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-agg</span> 'city <span style="color: #23d7d7;">:distinct</span>)
        <span style="color: #23d7d7;">:from</span> 'employee)
  <span style="color: #23d7d7;">:single</span>)

#(<span style="color: #e67128;">"New York"</span> <span style="color: #e67128;">"Toronto"</span> <span style="color: #e67128;">"Vancouver"</span>)

(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:array-agg</span> 'city <span style="color: #23d7d7;">:distinct</span> <span style="color: #23d7d7;">:order-by</span> (<span style="color: #23d7d7;">:desc</span> 'city))
        <span style="color: #23d7d7;">:from</span> 'employee)
  <span style="color: #23d7d7;">:single</span>)

#(<span style="color: #e67128;">"Vancouver"</span> <span style="color: #e67128;">"Toronto"</span> <span style="color: #e67128;">"New York"</span>)

(query (<span style="color: #23d7d7;">:select</span> 'city (<span style="color: #23d7d7;">:array-agg</span> 'salary <span style="color: #23d7d7;">:filter</span> (<span style="color: #23d7d7;">:&lt;</span> 'salary 50000))
        <span style="color: #23d7d7;">:from</span> 'employee
        <span style="color: #23d7d7;">:group-by</span> 'city))

((<span style="color: #e67128;">"Vancouver"</span> #(14420 26020)) (<span style="color: #e67128;">"New York"</span> #(40420 40620)) (<span style="color: #e67128;">"Toronto"</span> #(24020)))
</pre>
</div>
</div>
</div>


<div id="outline-container-org78d4fdc" class="outline-3">
<h3 id="org78d4fdc">NULL and nil</h3>
<div class="outline-text-3" id="text-org78d4fdc">
<p>
An empty array will be returned by postmodern as #().
</p>

<p>
<a href="s-sql.html">Return to s-sql.html</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
